Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official STM32L152D-EVAL.c

enum {
//*=default , +=alternate
//PIN    |BOARD LABEL                      |I2C1|I2C2|SPI1 |SPI2 |SPI3 |USART1|USART2|USART3|TIM (PWM)                    |USB|SDIO|RCC       |SYS           
PA0 , // |WAKEUP [B2 Blue Button]          |    |    |     |     |     |      |      |      |+TIM5_CH1 *TIM2_CH1          |   |    |          |              
PA1 , // |MIC_INP [KECG2740TBL]            |    |    |     |     |     |      |      |      |+TIM5_CH2 *TIM2_CH2          |   |    |          |              
PA2 , // |MIC_INN [KECG2740TBL]            |    |    |     |     |     |      |*TX   |      |+TIM5_CH3 +TIM9_CH1 *TIM2_CH3|   |    |          |              
PA3 , // |MIC_OUT                          |    |    |     |     |     |      |*RX   |      |+TIM5_CH4 +TIM9_CH2 *TIM2_CH4|   |    |          |              
PA4 , // |DAC_OUT1                         |    |    |     |     |     |      |      |      |                             |   |    |          |              
PA5 , // |E2P_SCK [M95040_C]               |    |    |*SCK |     |     |      |      |      |+TIM2_CH1                    |   |    |          |              
PA6 , // |OA2_IN [RV3]                     |    |    |*MISO|     |     |      |      |      |+TIM3_CH1 *TIM10_CH1         |   |    |          |              
PA7 , // |OA2_INN                          |    |    |*MOSI|     |     |      |      |      |+TIM3_CH2 *TIM11_CH1         |   |    |          |              
PA8 , // |                                 |    |    |     |     |     |      |      |      |                             |   |    |          |              
PA9 , // |USART1/IrDA_TX [ST3241EBPR_T2IN] |    |    |     |     |     |*TX   |      |      |                             |   |    |          |              
PA10, // |USART1/IrDA_RX [ST3241EBPR_R3OUT]|    |    |     |     |     |*RX   |      |      |                             |   |    |          |              
PA11, // |USB_DM                           |    |    |+MISO|     |     |      |      |      |                             |*DM|    |          |              
PA12, // |USB_DP                           |    |    |+MOSI|     |     |      |      |      |                             |*DP|    |          |              
PA13, // |SWDIO                            |    |    |     |     |     |      |      |      |                             |   |    |          |*JTMS-SWDIO   
PA14, // |SWCLK                            |    |    |     |     |     |      |      |      |                             |   |    |          |*JTCK-SWCLK   
PA15, // |TDI                              |    |    |     |     |     |      |      |      |+TIM2_CH1                    |   |    |          |*JTDI         
PB0 , // |OA2_OUT                          |    |    |     |     |     |      |      |      |*TIM3_CH3                    |   |    |          |              
PB1 , // |Audio_RST [CS43L22_RESET]        |    |    |     |     |     |      |      |      |*TIM3_CH4                    |   |    |          |              
PB2 , // |                                 |    |    |     |     |     |      |      |      |                             |   |    |          |              
PB3 , // |TDO/SWO                          |    |    |+SCK |     |+SCK |      |      |      |+TIM2_CH2                    |   |    |          |*JTDO-TRACESWO
PB4 , // |TRST                             |    |    |+MISO|     |+MISO|      |      |      |+TIM3_CH1                    |   |    |          |*JTRST        
PB5 , // |Temp_SMB [STLM75M2E_INT]         |    |    |+MOSI|     |+MOSI|      |      |      |+TIM3_CH2                    |   |    |          |              
PB6 , // |SHIELD_CT6_3 [Touch Sensing]     |*SCL|    |     |     |     |+TX   |      |      |+TIM4_CH1                    |   |    |          |              
PB7 , // |CT6_4 [Touch Sensing]            |*SDA|    |     |     |     |+RX   |      |      |+TIM4_CH2                    |   |    |          |*PVD_IN       
PB8 , // |Audio_Rf_Temp_SCL [STLM75M2E_SCL]|+SCL|    |     |     |     |      |      |      |+TIM10_CH1 +TIM4_CH3         |   |*D4 |          |              
PB9 , // |Audio_Rf_Temp_SDA [STLM75M2E_SDA]|+SDA|    |     |     |     |      |      |      |+TIM4_CH4 +TIM11_CH1         |   |*D5 |          |              
PB10, // |                                 |    |*SCL|     |     |     |      |      |*TX   |+TIM2_CH3                    |   |    |          |              
PB11, // |                                 |    |*SDA|     |     |     |      |      |*RX   |+TIM2_CH4                    |   |    |          |              
PB12, // |I2S_CMD [CS43L22_LRCK]           |    |    |     |     |     |      |      |      |+TIM10_CH1                   |   |    |          |              
PB13, // |I2S_CK [CS43L22_SCLK]            |    |    |     |*SCK |     |      |      |      |+TIM9_CH1                    |   |    |          |              
PB14, // |                                 |    |    |     |*MISO|     |      |      |      |+TIM9_CH2                    |   |    |          |              
PB15, // |I2S_DIN [CS43L22_SDIN]           |    |    |     |*MOSI|     |      |      |      |+TIM11_CH1                   |   |    |          |              
PC0 , // |                                 |    |    |     |     |     |      |      |      |                             |   |    |          |              
PC1 , // |LPF_OA3_INP                      |    |    |     |     |     |      |      |      |                             |   |    |          |              
PC2 , // |                                 |    |    |     |     |     |      |      |      |                             |   |    |          |              
PC3 , // |LPF_OA3_OUT                      |    |    |     |     |     |      |      |      |                             |   |    |          |              
PC4 , // |                                 |    |    |     |     |     |      |      |      |                             |   |    |          |              
PC5 , // |E2P_CS [M95040_S]                |    |    |     |     |     |      |      |      |                             |   |    |          |              
PC6 , // |I2S_MCK [CS43L22_MCLK]           |    |    |     |     |     |      |      |      |+TIM3_CH1                    |   |*D6 |          |              
PC7 , // |MicroSDCard_Detect               |    |    |     |     |     |      |      |      |+TIM3_CH2                    |   |*D7 |          |              
PC8 , // |MicroSDCard_D0                   |    |    |     |     |     |      |      |      |+TIM3_CH3                    |   |*D0 |          |              
PC9 , // |MicroSDCard_D1                   |    |    |     |     |     |      |      |      |+TIM3_CH4                    |   |*D1 |          |              
PC10, // |MicroSDCard_D2                   |    |    |     |     |*SCK |      |      |+TX   |                             |   |*D2 |          |              
PC11, // |MicroSDCard_D3                   |    |    |     |     |*MISO|      |      |+RX   |                             |   |*D3 |          |              
PC12, // |MicroSDCard_CLK                  |    |    |     |     |*MOSI|      |      |      |                             |   |*CK |          |              
PC13, // |IDD_CNT_EN                       |    |    |     |     |     |      |      |      |                             |   |    |          |              
PC14, // |PC14-OSC32_IN                    |    |    |     |     |     |      |      |      |                             |   |    |*OSC32_IN |              
PC15, // |PC15-OSC32_OUT                   |    |    |     |     |     |      |      |      |                             |   |    |*OSC32_OUT|              
PD0 , // |D2                               |    |    |     |     |     |      |      |      |+TIM9_CH1                    |   |    |          |              
PD1 , // |D3                               |    |    |     |+SCK |     |      |      |      |                             |   |    |          |              
PD2 , // |MicroSDCard_CMD                  |    |    |     |     |     |      |      |      |                             |   |*CMD|          |              
PD3 , // |LED1 [LD1 Green Led]             |    |    |     |+MISO|     |      |      |      |                             |   |    |          |              
PD4 , // |FSMC_NOE [NorFlash_G]            |    |    |     |+MOSI|     |      |      |      |                             |   |    |          |              
PD5 , // |FSMC_NWE [NorFlash_W]            |    |    |     |     |     |      |+TX   |      |                             |   |    |          |              
PD6 , // |FSMC_NWAIT [NorFlash_RB]         |    |    |     |     |     |      |+RX   |      |                             |   |    |          |              
PD7 , // |LED2 [LD2 Orange Led]            |    |    |     |     |     |      |      |      |+TIM9_CH2                    |   |    |          |              
PD8 , // |D13                              |    |    |     |     |     |      |      |+TX   |                             |   |    |          |              
PD9 , // |D14                              |    |    |     |     |     |      |      |+RX   |                             |   |    |          |              
PD10, // |D15                              |    |    |     |     |     |      |      |      |                             |   |    |          |              
PD11, // |A16                              |    |    |     |     |     |      |      |      |                             |   |    |          |              
PD12, // |A17                              |    |    |     |     |     |      |      |      |*TIM4_CH1                    |   |    |          |              
PD13, // |A18                              |    |    |     |     |     |      |      |      |*TIM4_CH2                    |   |    |          |              
PD14, // |D0                               |    |    |     |     |     |      |      |      |*TIM4_CH3                    |   |    |          |              
PD15, // |D1                               |    |    |     |     |     |      |      |      |*TIM4_CH4                    |   |    |          |              
PE0 , // |FSMC_NBL0 [SRAM_BLE]             |    |    |     |     |     |      |      |      |+TIM10_CH1                   |   |    |          |              
PE1 , // |FSMC_NBL1 [SRAM_BHE]             |    |    |     |     |     |      |      |      |+TIM11_CH1                   |   |    |          |              
PE2 , // |A23                              |    |    |     |     |     |      |      |      |                             |   |    |          |*TRACECK      
PE3 , // |A19                              |    |    |     |     |     |      |      |      |*TIM3_CH1                    |   |    |          |*TRACED0      
PE4 , // |A20                              |    |    |     |     |     |      |      |      |*TIM3_CH2                    |   |    |          |*TRACED1      
PE5 , // |A21                              |    |    |     |     |     |      |      |      |*TIM9_CH1                    |   |    |          |*TRACED2      
PE6 , // |                                 |    |    |     |     |     |      |      |      |                             |   |    |          |*TRACED3      
PE7 , // |D4                               |    |    |     |     |     |      |      |      |                             |   |    |          |              
PE8 , // |D5                               |    |    |     |     |     |      |      |      |                             |   |    |          |              
PE9 , // |D6                               |    |    |     |     |     |      |      |      |+TIM2_CH1                    |   |    |          |              
PE10, // |D7                               |    |    |     |     |     |      |      |      |+TIM2_CH2                    |   |    |          |              
PE11, // |D8                               |    |    |     |     |     |      |      |      |+TIM2_CH3                    |   |    |          |              
PE12, // |D9                               |    |    |     |     |     |      |      |      |+TIM2_CH4                    |   |    |          |              
PE13, // |D10                              |    |    |+SCK |     |     |      |      |      |                             |   |    |          |              
PE14, // |D11                              |    |    |+MISO|     |     |      |      |      |                             |   |    |          |              
PE15, // |D12                              |    |    |+MOSI|     |     |      |      |      |                             |   |    |          |              
PF0 , // |A0                               |    |    |     |     |     |      |      |      |                             |   |    |          |              
PF1 , // |A1                               |    |    |     |     |     |      |      |      |                             |   |    |          |              
PF2 , // |A2                               |    |    |     |     |     |      |      |      |                             |   |    |          |              
PF3 , // |A3                               |    |    |     |     |     |      |      |      |                             |   |    |          |              
PF4 , // |A4                               |    |    |     |     |     |      |      |      |                             |   |    |          |              
PF5 , // |A5                               |    |    |     |     |     |      |      |      |                             |   |    |          |              
PF6 , // |CT11_1 [Touch Sensing]           |    |    |     |     |     |      |      |      |*TIM5_CH1                    |   |    |          |              
PF7 , // |CT11_2 [Touch Sensing]           |    |    |     |     |     |      |      |      |*TIM5_CH2                    |   |    |          |              
PF8 , // |CT11_3 [Touch Sensing]           |    |    |     |     |     |      |      |      |*TIM5_CH3                    |   |    |          |              
PF9 , // |CT11_4 [Touch Sensing]           |    |    |     |     |     |      |      |      |*TIM5_CH4                    |   |    |          |              
PF10, // |Potentiometer [RV3]              |    |    |     |     |     |      |      |      |                             |   |    |          |              
PF11, // |IDD_Measurement                  |    |    |     |     |     |      |      |      |                             |   |    |          |              
PF12, // |A6                               |    |    |     |     |     |      |      |      |                             |   |    |          |              
PF13, // |A7                               |    |    |     |     |     |      |      |      |                             |   |    |          |              
PF14, // |A8                               |    |    |     |     |     |      |      |      |                             |   |    |          |              
PF15, // |A9                               |    |    |     |     |     |      |      |      |                             |   |    |          |              
PG0 , // |A10                              |    |    |     |     |     |      |      |      |                             |   |    |          |              
PG1 , // |A11                              |    |    |     |     |     |      |      |      |                             |   |    |          |              
PG2 , // |A12                              |    |    |     |     |     |      |      |      |                             |   |    |          |              
PG3 , // |A13                              |    |    |     |     |     |      |      |      |                             |   |    |          |              
PG4 , // |A14                              |    |    |     |     |     |      |      |      |                             |   |    |          |              
PG5 , // |A15                              |    |    |     |     |     |      |      |      |                             |   |    |          |              
PG6 , // |JOY_LEFT [MT008-A_LEFT]          |    |    |     |     |     |      |      |      |                             |   |    |          |              
PG7 , // |JOY_RIGHT [MT008-A_RIGHT]        |    |    |     |     |     |      |      |      |                             |   |    |          |              
PG8 , // |JOY_DOWN [MT008-A_DOWN]          |    |    |     |     |     |      |      |      |                             |   |    |          |              
PG9 , // |CS_NOR_EBAR1 [NorFlash_E]        |    |    |     |     |     |      |      |      |                             |   |    |          |              
PG10, // |CS_RAM_EBAR2 [SRAM_CE]           |    |    |     |     |     |      |      |      |                             |   |    |          |              
PG11, // |JOY_UP [MT008-A_UP]              |    |    |     |     |     |      |      |      |                             |   |    |          |              
PG12, // |LCD_EBAR3 [TFTLCD_CS]            |    |    |     |     |     |      |      |      |                             |   |    |          |              
PG13, // |JOY_SEL [MT008-A_Selection]      |    |    |     |     |     |      |      |      |                             |   |    |          |              
PG14, // |LED3 [LD3 Red Led]               |    |    |     |     |     |      |      |      |                             |   |    |          |              
PG15, // |LED4 [LD4 Blue Led]              |    |    |     |     |     |      |      |      |                             |   |    |          |              
PH0 , // |PH0_OSC_IN                       |    |    |     |     |     |      |      |      |                             |   |    |*OSC_IN   |              
PH1 , // |PH1_OSC_OUT                      |    |    |     |     |     |      |      |      |                             |   |    |*OSC_OUT  |              
PH2 , // |A22                              |    |    |     |     |     |      |      |      |                             |   |    |          |              
NB_DIGITAL_PINS,
};

#include "stm32f1xx_hal.h"
#include "spi_com.h"
#include "twi.h"
#include "uart.h"
#include "analog.h"
#include "variant.h"

